Repository: 84000/data-translation-memory
Catalog: toh44-31_84000-the-ten-bhumis.tmx
Source language: bo
Languages: en

source: །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་མངོན་པར་གནང་སྟེ། ཡིད་དགའ་བར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེའི་སྙིང་པོས་དེ་སྐད་ཅེས་སྨྲས་པ་དང་། བཅོམ་ལྡན་འདས་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷའི་ནང་ན་བཞུགས་ཤིང་མངོན་པར་སངས་རྒྱས་ནས་རིང་པོར་མ་ལོན་ཏེ། ཞག་བདུན་པ་གཉིས་ལ་བབ་པའི་ཚེ་ལྷའི་རྒྱལ་པོ་དབང་བྱེད་ཀྱི་གཞལ་མེད་ཁང་ནོར་བུ་རིན་པོ་ཆེའི་སྙིང་པོ་ཅན་ན་བཞུགས་པས། བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོས་བཤད་པ་ལ་མངོན་པར་དགྱེས་པ་མཛད་དོ།
en: The tathāgata arhat samyak­sambuddha gave his authorization, and the bodhisattva mahāsattva Vajra­garbha spoke those words with joy. The Bhagavat was residing in the Para­nirmita­vaśa­vartin paradise not long after his buddhahood, during the second week, seated upon the jewel dais in the immeasurable precious palace of the deva king Vaśavartin, and he was pleased with the words of the bodhisattva Vajra­garbha.

source: །བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དེ་དག་ཐམས་ཅད་དང་། ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་ལྷ་མ་ཡིན་དང་། བརྒྱ་བྱིན་དང་ཚངས་པ་དང་། འཇིག་རྟེན་གྱི་མགོན་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། གཙང་མའི་རིས་སུ་གཏོགས་པའི་འཁོར་ཐམས་ཅད་ཀྱང་མངོན་པར་དགའོ།
en: The entire assembly of bodhisattvas, and the assembly of devas, nāgas, yakṣas gandharvas, asuras, Śakra devas, Brahmā devas, lokapālas, and Maheśvara and Śuddhāvāsa devas rejoiced.

source: །ས་བཅུའི་ལེའུ་སྟེ་སུམ་ཅུ་གཅིག་པའོ།།
en: This concludes “The Ten Bhūmis,” chapter thirty-one of “A Multitude of Buddhas.”
